package com.brojang.java.ex03.operator;

public class Basic {
/*
연산하는데 사용
연산자 : 연산 수행 기호
피연산자 : 연산자 작업 대상(변수, 상수, 리터럴, 수식 등)

종류
-> 1. 증감연산자
    
→ ++, --
    
++ : 증가 연산자. 피연산자를 1 증가
    
-- : 감소 연산자. 피연산자를 1 감소
    
- 타입
1. 전위형
            
→ 값이 참조되기 전에 증가
            
`result = ++i`
            
2. 후위형
            
→ 값이 참조된 후에 증가
            
`result = i++`


2. 산술 연산자
    
→ +, -, *, /,%
※ 주의 : 연산자로 연산을 수행할 때 중요한 점은 타입의 형변환을 통해 다른 타입간 연산은 타입 일치를 시킨다.

byte, short, char 등은 int로 변환(연산 시)

int + float → float + float로 변환 ← 실수 타입이 존재할 경우 실수 형태로 변환
        
3. 시프트 연산자
    
→ <<, >>, >>>

<< : 피 연산자의 비트를 왼쪽으로 이동 (빈공간은 0으로 대체)
    
>> : 피 연산자의 비트를 오른쪽으로 이동(빈공간은 결과 값이 음수 일 경우 1, 양수일 경우 0으로 대체)
    
>>> : 피 연산자의 비트를 오른쪽으로 이동(빈 공간은 0으로 대체)
    
4. 비교 연산자
    
→ >`, `<`, `>=`, `<=`,** `==,`!=

→ 비교연산자의 결과는 boolean 타입
    
5. 비트 연산자
    
→ &, |, ^, ~

→ & : AND 연산(둘 다 1일 경우에만 1), | : OR 연산(둘 중 하나라도 1이면 1), ^ : XOR 연산(서로 다를 경우 1)
    
6. 논리 연산자
    
→ &&, ||, `!`

7. 삼항 연산자
    
→ ? :

8. 할당 연산자
    
→ `=`, *=, /=,%=,+=,-=

9. instanceof 비교 연산자
    
→ 주로 참조형 변수의 타입을 비교하기 위해 사용
*/
}
