package com.brojang.java.ex08._class;

public class MethodBasic {
    // 메서드
    /**
     * 변수 종류 3가지
     * 1. 클래스 변수
     * 2. 인스턴스 변수
     * 3. 지역 변수
     *
     * 클래스 변수
     *
     * → 인스턴스 변수 중 static으로 지정된 변수
     *
     * → 프로그램 실행이 되면 메모리에 생성, 프로그램이 종료되면 소멸
     *
     * → 초기화시키지 않을 경우 default 초기화가 진행
     *
     * → 1회 생성
     *
     * → 모든 객체에서 접근(공유) 가능
     *
     *
     *
     * 인스턴스 변수
     *
     * → 클래스의 멤버로 선언되는 변수
     *
     * → 클래스 객체 생성 시 메모리에 생성, 객체 소멸 시 변수 소멸
     *
     * → 초기화시키지 않을 경우 default 초기화가 진행
     *
     * → 객체 생성 시마다 생성되는 변수(전역 변수)
     *
     *
     *
     * 지역 변수
     *
     * → 메서드 내에서 선언
     *
     * → 메서드 호출 시 생성 후 메서드 복귀 시 소멸
     *
     * → 선언과 동시에 반드시 초기화
     *
     * 메서드 특징
     * -> 높은 재사용성
     *
     * -> 중복 코드 제거
     *
     * -> 프로그램의 구조화
     * */
}
